#### Cluster ☸️ `Production`

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster-late[0].cloudflare_record.nginx_ingress[0] will be created
  + resource "cloudflare_record" "nginx_ingress" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "gke-ingress"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "A"
      + value       = (known after apply)
      + zone_id     = "7c80c99c0851ee5f78ffc95301739c3b"
    }

  # module.cluster-late[0].google_compute_backend_service.nginx_ingress_443 will be created
  + resource "google_compute_backend_service" "nginx_ingress_443" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "nginx-ingress-443"
      + port_name                       = (known after apply)
      + project                         = (known after apply)
      + protocol                        = "TCP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "CONNECTION"
          + capacity_scaler              = 1
          + group                        = "https://www.googleapis.com/compute/v1/projects/rkgke-prod-03/zones/europe-west2-a/networkEndpointGroups/rkgke-prod-03-nginx-ingress-443"
          + max_connections_per_endpoint = 16384
          + max_utilization              = 0.8
        }
      + backend {
          + balancing_mode               = "CONNECTION"
          + capacity_scaler              = 1
          + group                        = "https://www.googleapis.com/compute/v1/projects/rkgke-prod-03/zones/europe-west2-b/networkEndpointGroups/rkgke-prod-03-nginx-ingress-443"
          + max_connections_per_endpoint = 16384
          + max_utilization              = 0.8
        }
      + backend {
          + balancing_mode               = "CONNECTION"
          + capacity_scaler              = 1
          + group                        = "https://www.googleapis.com/compute/v1/projects/rkgke-prod-03/zones/europe-west2-c/networkEndpointGroups/rkgke-prod-03-nginx-ingress-443"
          + max_connections_per_endpoint = 16384
          + max_utilization              = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # module.cluster-late[0].google_compute_firewall.nginx_ingress_health_check will be created
  + resource "google_compute_firewall" "nginx_ingress_health_check" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "nginx-ingress-health-check"
      + network            = "projects/rkgke-prod-03/global/networks/default"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "130.211.0.0/22",
          + "35.191.0.0/16",
        ]
      + target_tags        = [
          + "load-balanced-backend",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # module.cluster-late[0].google_compute_global_address.nginx_ingress_ip[0] will be created
  + resource "google_compute_global_address" "nginx_ingress_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "nginx-ingress-ip"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # module.cluster-late[0].google_compute_global_forwarding_rule.nginx_ingress_443[0] will be created
  + resource "google_compute_global_forwarding_rule" "nginx_ingress_443" {
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "TCP"
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "nginx-ingress-443"
      + port_range            = "443"
      + project               = (known after apply)
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # module.cluster-late[0].google_compute_global_forwarding_rule.nginx_ingress_80_https_redirect[0] will be created
  + resource "google_compute_global_forwarding_rule" "nginx_ingress_80_https_redirect" {
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "nginx-ingress-80-https-redirect"
      + port_range            = "80"
      + project               = (known after apply)
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # module.cluster-late[0].google_compute_health_check.nginx_ingress_443_health_check will be created
  + resource "google_compute_health_check" "nginx_ingress_443_health_check" {
      + check_interval_sec  = 5
      + creation_timestamp  = (known after apply)
      + description         = "Health check via GET https://healthz"
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "nginx-ingress-443-health-check"
      + project             = (known after apply)
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + type                = (known after apply)
      + unhealthy_threshold = 2

      + https_health_check {
          + port_specification = "USE_SERVING_PORT"
          + proxy_header       = "PROXY_V1"
          + request_path       = "/healthz"
        }
    }

  # module.cluster-late[0].google_compute_target_http_proxy.nginx_ingress_80_https_redirect will be created
  + resource "google_compute_target_http_proxy" "nginx_ingress_80_https_redirect" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "nginx-ingress-80-https-redirect"
      + project            = (known after apply)
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # module.cluster-late[0].google_compute_target_tcp_proxy.nginx_ingress_443 will be created
  + resource "google_compute_target_tcp_proxy" "nginx_ingress_443" {
      + backend_service    = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "nginx-ingress-443"
      + project            = (known after apply)
      + proxy_bind         = (known after apply)
      + proxy_header       = "PROXY_V1"
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
    }

  # module.cluster-late[0].google_compute_url_map.nginx_ingress_80_https_redirect will be created
  + resource "google_compute_url_map" "nginx_ingress_80_https_redirect" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "nginx-ingress-80-https-redirect"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect         = true
          + redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
          + strip_query            = false
        }
    }

  # module.cluster-late[0].google_logging_project_bucket_config.cert_manager will be created
  + resource "google_logging_project_bucket_config" "cert_manager" {
      + bucket_id       = "cert-manager"
      + description     = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "global"
      + name            = (known after apply)
      + project         = "rkgke-prod-03"
      + retention_days  = 30
    }

  # module.cluster-late[0].google_logging_project_bucket_config.default will be created
  + resource "google_logging_project_bucket_config" "default" {
      + bucket_id       = "_Default"
      + description     = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "global"
      + name            = (known after apply)
      + project         = "rkgke-prod-03"
      + retention_days  = 14
    }

  # module.cluster-late[0].google_logging_project_exclusion.cert_manager will be created
  + resource "google_logging_project_exclusion" "cert_manager" {
      + description = "Exclude cert-manager namespace logs. Stored elsewhere."
      + filter      = "resource.type = k8s_container resource.labels.namespace_name=\"cert-manager\" "
      + id          = (known after apply)
      + name        = "cert-manager"
      + project     = (known after apply)
    }

  # module.cluster-late[0].google_logging_project_sink.cert_manager will be created
  + resource "google_logging_project_sink" "cert_manager" {
      + destination            = (known after apply)
      + filter                 = "resource.type = k8s_container resource.labels.namespace_name=\"cert-manager\" "
      + id                     = (known after apply)
      + name                   = "cert-manager"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.cluster-late[0].kubernetes_manifest.cert_manager_cf_issuer[0] will be created
  + resource "kubernetes_manifest" "cert_manager_cf_issuer" {
      + manifest = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + name = "letsencrypt-issuer"
            }
          + spec       = {
              + acme = {
                  + email               = "rkwaysltd@gmail.com"
                  + privateKeySecretRef = {
                      + name = "letsencrypt-issuer-account-key"
                    }
                  + server              = "https://acme-v02.api.letsencrypt.org/directory"
                  + solvers             = [
                      + {
                          + dns01    = {
                              + cloudflare = {
                                  + apiTokenSecretRef = {
                                      + key  = "api-token"
                                      + name = "cloudflare-api-token-secret"
                                    }
                                  + email             = "rkwaysltd@gmail.com"
                                }
                            }
                          + selector = {
                              + dnsZones = [
                                  + "rkways.com",
                                ]
                            }
                        },
                    ]
                }
            }
        }
      + object   = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "letsencrypt-issuer"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + acme       = {
                  + disableAccountKeyGeneration = (known after apply)
                  + email                       = "rkwaysltd@gmail.com"
                  + enableDurationFeature       = (known after apply)
                  + externalAccountBinding      = {
                      + keyAlgorithm = (known after apply)
                      + keyID        = (known after apply)
                      + keySecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + preferredChain              = (known after apply)
                  + privateKeySecretRef         = {
                      + key  = (known after apply)
                      + name = "letsencrypt-issuer-account-key"
                    }
                  + server                      = "https://acme-v02.api.letsencrypt.org/directory"
                  + skipTLSVerify               = (known after apply)
                  + solvers                     = [
                      + {
                          + dns01    = {
                              + acmeDNS       = {
                                  + accountSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + host             = (known after apply)
                                }
                              + akamai        = {
                                  + accessTokenSecretRef  = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + clientSecretSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + clientTokenSecretRef  = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + serviceConsumerDomain = (known after apply)
                                }
                              + azureDNS      = {
                                  + clientID              = (known after apply)
                                  + clientSecretSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + environment           = (known after apply)
                                  + hostedZoneName        = (known after apply)
                                  + resourceGroupName     = (known after apply)
                                  + subscriptionID        = (known after apply)
                                  + tenantID              = (known after apply)
                                }
                              + cloudDNS      = {
                                  + hostedZoneName          = (known after apply)
                                  + project                 = (known after apply)
                                  + serviceAccountSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + cloudflare    = {
                                  + apiKeySecretRef   = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + apiTokenSecretRef = {
                                      + key  = "api-token"
                                      + name = "cloudflare-api-token-secret"
                                    }
                                  + email             = "rkwaysltd@gmail.com"
                                }
                              + cnameStrategy = (known after apply)
                              + digitalocean  = {
                                  + tokenSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + rfc2136       = {
                                  + nameserver          = (known after apply)
                                  + tsigAlgorithm       = (known after apply)
                                  + tsigKeyName         = (known after apply)
                                  + tsigSecretSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + route53       = {
                                  + accessKeyID              = (known after apply)
                                  + hostedZoneID             = (known after apply)
                                  + region                   = (known after apply)
                                  + role                     = (known after apply)
                                  + secretAccessKeySecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + webhook       = {
                                  + config     = (known after apply)
                                  + groupName  = (known after apply)
                                  + solverName = (known after apply)
                                }
                            }
                          + http01   = {
                              + ingress = {
                                  + class           = (known after apply)
                                  + ingressTemplate = {
                                      + metadata = {
                                          + annotations = (known after apply)
                                          + labels      = (known after apply)
                                        }
                                    }
                                  + name            = (known after apply)
                                  + podTemplate     = {
                                      + metadata = {
                                          + annotations = (known after apply)
                                          + labels      = (known after apply)
                                        }
                                      + spec     = {
                                          + affinity           = {
                                              + nodeAffinity    = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                                      + nodeSelectorTerms = (known after apply)
                                                    }
                                                }
                                              + podAffinity     = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                                }
                                              + podAntiAffinity = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                                }
                                            }
                                          + nodeSelector       = (known after apply)
                                          + priorityClassName  = (known after apply)
                                          + serviceAccountName = (known after apply)
                                          + tolerations        = (known after apply)
                                        }
                                    }
                                  + serviceType     = (known after apply)
                                }
                            }
                          + selector = {
                              + dnsNames    = (known after apply)
                              + dnsZones    = [
                                  + "rkways.com",
                                ]
                              + matchLabels = (known after apply)
                            }
                        },
                    ]
                }
              + ca         = {
                  + crlDistributionPoints = (known after apply)
                  + secretName            = (known after apply)
                }
              + selfSigned = {
                  + crlDistributionPoints = (known after apply)
                }
              + vault      = {
                  + auth      = {
                      + appRole        = {
                          + path      = (known after apply)
                          + roleId    = (known after apply)
                          + secretRef = {
                              + key  = (known after apply)
                              + name = (known after apply)
                            }
                        }
                      + kubernetes     = {
                          + mountPath = (known after apply)
                          + role      = (known after apply)
                          + secretRef = {
                              + key  = (known after apply)
                              + name = (known after apply)
                            }
                        }
                      + tokenSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + caBundle  = (known after apply)
                  + namespace = (known after apply)
                  + path      = (known after apply)
                  + server    = (known after apply)
                }
              + venafi     = {
                  + cloud = {
                      + apiTokenSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                      + url               = (known after apply)
                    }
                  + tpp   = {
                      + caBundle       = (known after apply)
                      + credentialsRef = {
                          + name = (known after apply)
                        }
                      + url            = (known after apply)
                    }
                  + zone  = (known after apply)
                }
            }
        }
    }

  # module.cluster-late[0].kubernetes_manifest.nginx_ingress_certificate[0] will be created
  + resource "kubernetes_manifest" "nginx_ingress_certificate" {
      + manifest = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "Certificate"
          + metadata   = {
              + name      = "nginx-ingress-certificate"
              + namespace = "nginx-ingress"
            }
          + spec       = {
              + commonName = "*.rkways.com"
              + dnsNames   = [
                  + "*.rkways.com",
                ]
              + issuerRef  = {
                  + kind = "ClusterIssuer"
                  + name = "letsencrypt-issuer"
                }
              + secretName = "nginx-ingress-certificate"
            }
        }
      + object   = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "Certificate"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "nginx-ingress-certificate"
              + namespace                  = "nginx-ingress"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + commonName            = "*.rkways.com"
              + dnsNames              = [
                  + "*.rkways.com",
                ]
              + duration              = (known after apply)
              + emailAddresses        = (known after apply)
              + encodeUsagesInRequest = (known after apply)
              + ipAddresses           = (known after apply)
              + isCA                  = (known after apply)
              + issuerRef             = {
                  + group = (known after apply)
                  + kind  = "ClusterIssuer"
                  + name  = "letsencrypt-issuer"
                }
              + keystores             = {
                  + jks    = {
                      + create            = (known after apply)
                      + passwordSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + pkcs12 = {
                      + create            = (known after apply)
                      + passwordSecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                }
              + privateKey            = {
                  + algorithm      = (known after apply)
                  + encoding       = (known after apply)
                  + rotationPolicy = (known after apply)
                  + size           = (known after apply)
                }
              + renewBefore           = (known after apply)
              + secretName            = "nginx-ingress-certificate"
              + subject               = {
                  + countries           = (known after apply)
                  + localities          = (known after apply)
                  + organizationalUnits = (known after apply)
                  + organizations       = (known after apply)
                  + postalCodes         = (known after apply)
                  + provinces           = (known after apply)
                  + serialNumber        = (known after apply)
                  + streetAddresses     = (known after apply)
                }
              + uris                  = (known after apply)
              + usages                = (known after apply)
            }
        }
    }

  # module.cluster-late[0].kubernetes_secret.cert_manager_cf[0] will be created
  + resource "kubernetes_secret" "cert_manager_cf" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "cloudflare-api-token-secret"
          + namespace        = "cert-manager"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cluster-late[0].kubernetes_storage_class.premium_rwo_cmek will be created
  + resource "kubernetes_storage_class" "premium_rwo_cmek" {
      + allow_volume_expansion = true
      + id                     = (known after apply)
      + parameters             = {
          + "disk-encryption-kms-key" = "projects/rkgke-prod-03/locations/europe-west2/keyRings/karamba-prod/cryptoKeys/k8s-sc-storageclass-cmek-disk"
          + "type"                    = "pd-ssd"
        }
      + reclaim_policy         = "Delete"
      + storage_provisioner    = "pd.csi.storage.gke.io"
      + volume_binding_mode    = "WaitForFirstConsumer"

      + metadata {
          + generation       = (known after apply)
          + name             = "premium-rwo-cmek"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cluster-late[0].kubernetes_storage_class.standard_cmek will be created
  + resource "kubernetes_storage_class" "standard_cmek" {
      + allow_volume_expansion = true
      + id                     = (known after apply)
      + parameters             = {
          + "disk-encryption-kms-key" = "projects/rkgke-prod-03/locations/europe-west2/keyRings/karamba-prod/cryptoKeys/k8s-sc-storageclass-cmek-disk"
          + "type"                    = "pd-standard"
        }
      + reclaim_policy         = "Delete"
      + storage_provisioner    = "pd.csi.storage.gke.io"
      + volume_binding_mode    = "WaitForFirstConsumer"

      + metadata {
          + annotations      = {
              + "storageclass.kubernetes.io/is-default-class" = "true"
            }
          + generation       = (known after apply)
          + name             = "standard-cmek"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cluster-late[0].kubernetes_storage_class.standard_rwo_cmek will be created
  + resource "kubernetes_storage_class" "standard_rwo_cmek" {
      + allow_volume_expansion = true
      + id                     = (known after apply)
      + parameters             = {
          + "disk-encryption-kms-key" = "projects/rkgke-prod-03/locations/europe-west2/keyRings/karamba-prod/cryptoKeys/k8s-sc-storageclass-cmek-disk"
          + "type"                    = "pd-balanced"
        }
      + reclaim_policy         = "Delete"
      + storage_provisioner    = "pd.csi.storage.gke.io"
      + volume_binding_mode    = "WaitForFirstConsumer"

      + metadata {
          + generation       = (known after apply)
          + name             = "standard-rwo-cmek"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cluster-late[0].module.gcloud_no_default_standard_storageclass.module.gcloud_kubectl.null_resource.additional_components[0] will be created
  + resource "null_resource" "additional_components" {
      + id       = (known after apply)
      + triggers = {
          + "additional_components_command" = ".terraform/modules/cluster-late.gcloud_no_default_standard_storageclass/scripts/check_components.sh gcloud kubectl"
          + "arguments"                     = "5fd731d6c143ab033e2d640afb5d1372"
          + "md5"                           = "d075670241e379e60341edd8f6b4711f"
        }
    }

  # module.cluster-late[0].module.gcloud_no_default_standard_storageclass.module.gcloud_kubectl.null_resource.additional_components_destroy[0] will be created
  + resource "null_resource" "additional_components_destroy" {
      + id       = (known after apply)
      + triggers = {
          + "additional_components_command" = ".terraform/modules/cluster-late.gcloud_no_default_standard_storageclass/scripts/check_components.sh gcloud kubectl"
        }
    }

  # module.cluster-late[0].module.gcloud_no_default_standard_storageclass.module.gcloud_kubectl.null_resource.run_command[0] will be created
  + resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = {
          + "arguments"             = "5fd731d6c143ab033e2d640afb5d1372"
          + "create_cmd_body"       = "karamba-prod europe-west2 rkgke-prod-03 false false kubectl annotate storageclass standard storageclass.kubernetes.io/is-default-class-"
          + "create_cmd_entrypoint" = ".terraform/modules/cluster-late.gcloud_no_default_standard_storageclass/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
          + "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
          + "md5"                   = "d075670241e379e60341edd8f6b4711f"
        }
    }

  # module.cluster-late[0].module.gcloud_no_default_standard_storageclass.module.gcloud_kubectl.null_resource.run_destroy_command[0] will be created
  + resource "null_resource" "run_destroy_command" {
      + id       = (known after apply)
      + triggers = {
          + "destroy_cmd_body"       = "karamba-prod europe-west2 rkgke-prod-03 false false kubectl annotate storageclass standard storageclass.kubernetes.io/is-default-class=true"
          + "destroy_cmd_entrypoint" = ".terraform/modules/cluster-late.gcloud_no_default_standard_storageclass/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
          + "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @kupson, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*